One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c

#include <devices.h>
#include <stm32f407.h>
#include <sys.h>
#include <io.h>
#include <string.h>

#include <usb_core.h>
#include <usb_device.h>


static int reset_core(struct usb_otg_regs *);
static int write_pkt(struct usb_dev_handle *,unsigned int cp_num, unsigned char *buf, size_t len);
static int read_pkt(struct usb_dev_handle *, unsigned char *buf, size_t len);
static unsigned int get_mode(struct usb_otg_regs *);
static unsigned int get_core_irq_stat(struct usb_otg_regs *);
static unsigned int get_otg_irq_stat();
        /****                                     ****/
static int host_init_core();
static int host_enable_int(struct usb_dev_handle *);
static void host_stop();
static int isEvenFrame(struct usb_otg_regs *);
static void vbus_drive(struct usb_otg_regs *regs, unsigned int state);
static void init_fs_ls_p_clksel(struct usb_otg_regs *,unsigned int freq);
static unsigned int read_hprt0(struct usb_otg_regs *);
static unsigned int get_host_all_channel_irq(struct usb_otg_regs *);
static int reset_port();
        /****                                     ****/
static int host_channel_init(struct usb_dev_handle *,unsigned int host_channel);
static int host_channel_start_tx(struct usb_dev_handle *, unsigned int host_channel);
static int host_channel_halt(struct usb_otg_regs *,unsigned int host_channel);
static int host_channel_do_ping(struct usb_otg_regs *,unsigned int host_channel);
        /****                                    ****/
static void dev_speed_init(struct usb_otg_regs *, unsigned int speed);
static int dev_enable_int();
static unsigned int dev_get_speed(struct usb_otg_regs *);
static int dev_EP0_activate(struct usb_otg_regs *);
static unsigned int dev_read_all_out_ep_irq();
static unsigned int dev_read_out_ep_irq(struct usb_otg_regs *,unsigned int channel);
static unsigned int dev_read_all_in_ep_irq();
void dev_remote_wakeup();
static void dev_ungate_clock();
static void dev_stop();

struct usb_host *usb_host;


/*****************************************************/

static int config_vbus(void) {
	sys_printf("config vbus\n");
	return 0;
}

static int drive_vbus(unsigned int state) {
	sys_printf("drive vbus %d\n", state);
	return 0;
}

/*****************************************************/

static void common_irq_enable(struct usb_otg_regs *regs) {

	regs->core.g_otg_gint=0xffffffff;
	regs->core.g_int_sts= 0xbfffffff;

	regs->core.g_int_msk=(G_INT_STS_WKUIN|G_INT_STS_USBSUSP|
				G_INT_STS_OTGINT|G_INT_STS_SRQINT|
                                G_INT_STS_CIDSCHG);
}

static int reset_core(struct usb_otg_regs *regs) {
	int count=20000;
	while(!(regs->core.g_rst_ctl&G_RST_CFG_AHBIDL)) {
                sys_udelay(10);  
		count--;
		if (!count) return -1;
        }
        regs->core.g_rst_ctl|=G_RST_CFG_CSRST;
        while(regs->core.g_rst_ctl&G_RST_CFG_CSRST);
        sys_udelay(3);
	return 0;
}

static int write_pkt(struct usb_dev_handle *pdev,
			unsigned int ep_num, 
			unsigned char *buf, 
			size_t len) {

	if (!pdev->cfg.dma_enable) {
		unsigned int i;
		unsigned int wcount=(len+3)>>2;
		volatile unsigned int *fifo;
		
		fifo=pdev->regs->dfifo[ep_num];
		for(i=0;i<wcount;i++) {
			*fifo=((unsigned int *)buf)[i];
		}
	}
	return 0;
}

static int read_pkt(struct usb_dev_handle *pdev, 
			unsigned char *buf, 
			size_t len) {
	unsigned int i;
	unsigned int wcount=(len+3)>>2;
	volatile unsigned int *fifo=pdev->regs->dfifo[0];
	
	for(i=0;i<wcount;i++) {
		((unsigned int *)buf)[i]=*fifo;
	}
	return 0;
}

int usb_config_core(struct usb_dev_handle *pdev) {
	pdev->cfg.dma_enable=0;
	pdev->cfg.speed=USB_SPEED_FULL;
	pdev->cfg.maxpacketsize=USB_FS_MAX_PACKET_SIZE;

#if defined(MB1075B)
	pdev->regs=(struct usb_otg_regs *)USB_OTG_HS_ADDR;
	pdev->cfg.host_channels         = 12;
	pdev->cfg.dev_endpoints         = 6;
	pdev->cfg.total_fifo_size       = 1280; /* ints */
	pdev->cfg.phy_itf               = USB_OTG_EMBEDDED_PHY;
	pdev->cfg.dma_enable            = 1;

#ifdef USB_SOF_ENABLED
	pdev->cfg.sof_output            = 1;
#endif

#ifdef USB_LOW_PWR_MGMT_SUPPORT
	pdev->cfg.low_power             = 1;
#endif

#elif defined(MB997C)
	pdev->regs=(struct usb_otg_regs *)USB_OTG_FS_ADDR;
	pdev->cfg.host_channels         = 8;
	pdev->cfg.dev_endpoints         = 4;
	pdev->cfg.total_fifo_size       = 320; /* ints */
	pdev->cfg.phy_itf               = USB_OTG_EMBEDDED_PHY;

#ifdef USB_SOF_ENABLED
	pdev->cfg.sof_output            = 1;
#endif

#ifdef USB_LOW_PWR_MGMT_SUPPORT
	pdev->cfg.low_power             = 1;
#endif

#else
	return -1;
#endif
	return 0;
}

int usb_core_init_core(struct usb_otg_regs *regs, struct usb_cfg *usb_cfg) {
	/* Use the embedded FS interface */
	regs->core.g_usb_cfg|=G_USB_CFG_PHSEL;
	reset_core(regs);
	if (usb_cfg->sof_output) {
		regs->core.g_c_cfg=G_C_CFG_SOFOUTEN|
				G_C_CFG_VBUSBSEN|
				G_C_CFG_VBUSASEN|
				G_C_CFG_PWRDWN;
		
	} else {
		regs->core.g_c_cfg=G_C_CFG_VBUSBSEN|
				G_C_CFG_VBUSASEN|
				G_C_CFG_PWRDWN;
	}
	sys_mdelay(20);

	if (usb_cfg->dma_enable) {
		regs->core.g_ahb_cfg|=(G_AHB_CFG_DMAEN|
				(5<<G_AHB_CFG_HBSTLEN_SHIFT));
	}

	regs->core.g_usb_cfg|=(G_USB_CFG_HNPCAP|G_USB_CFG_SRPCAP);	
	
	common_irq_enable(regs);
	return 0;
}

int usb_core_enable_gint(struct usb_otg_regs *regs) {
	regs->core.g_ahb_cfg|=G_AHB_GINT;
	return 0;
}

int usb_core_disable_gint(struct usb_otg_regs *regs) {
	regs->core.g_ahb_cfg&=~G_AHB_GINT;
	return 0;
}

int usb_core_flush_tx_fifo(struct usb_otg_regs *regs, unsigned int fifo) {
	unsigned int count=200000;

	regs->core.g_rst_ctl=G_RST_CFG_TXFFLSH|
				(fifo<<G_RST_CFG_TXFNUM_SHIFT);
	while(regs->core.g_rst_ctl&G_RST_CFG_TXFFLSH) {
		count--;
		if (!count) return -1;
	}
	sys_udelay(3);
	return 0;
}

int usb_core_flush_rx_fifo(struct usb_otg_regs *regs) {
	unsigned int count=200000;

	regs->core.g_rst_ctl=G_RST_CFG_RXFFLSH;
	while(regs->core.g_rst_ctl&G_RST_CFG_RXFFLSH) {
		count--;
		if (!count) return -1;
	}
	sys_udelay(3);
	return 0;
}

int usb_core_set_mode(struct usb_otg_regs *regs, unsigned int mode) {
	
	unsigned int usbcfg=regs->core.g_usb_cfg;
	usbcfg&=~(G_USB_CFG_FHMOD|G_USB_CFG_FDMOD);
	if (mode==HOST_MODE) {
		usbcfg|=G_USB_CFG_FHMOD;
	} else if (mode==DEVICE_MODE) {
		usbcfg|=G_USB_CFG_FDMOD;
	} else {
		return -1;
	}
	regs->core.g_usb_cfg=usbcfg;
	sys_mdelay(50);
	return 0;
}

static unsigned int get_mode(struct usb_otg_regs *regs) {
	return regs->core.g_int_sts&G_INT_STS_CMOD;
}

static unsigned int get_core_irq_stat(struct usb_otg_regs *regs) {
	unsigned int i=regs->core.g_int_sts;
	i&=regs->core.g_int_msk;
	return i;
}

