One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
static unsigned int get_otg_irq_stat(struct usb_otg_regs *regs) {
	return regs->core.g_otg_gint;
}

static int host_init_core(struct usb_dev_handle *pdev) {
	int i;	
	config_vbus();
	
	pdev->regs->pwrclk=0;
	init_fs_ls_p_clksel(pdev->regs, H_CFG_FSLSPC_48);
	reset_port();
	
	pdev->regs->host.h_cfg&=~H_CFG_FSLSS;
	
	if (pdev->regs==USB_OTG_HS_ADDR) {
		pdev->regs->core.g_rx_fsiz=RX_FIFO_HS_SIZE; // 512
		pdev->regs->core.g_nptxfcnf=(TXH_NP_FIFO_HS_SIZE<<G_NPTX_FCNF_D_SHIFT)| // 96
				(RX_FIFO_HS_SIZE<<G_NPTX_FCNF_A_SHIFT);  // 512

		pdev->regs->core.hptx_fcnf=(TXH_P_FIFO_HS_SIZE<<PTX_FCNF_D_SHIFT) |
			((RX_FIFO_HS_SIZE+TXH_NP_FIFO_HS_SIZE)<<PTX_FCNF_A_SHIFT);
	} else {
		pdev->regs->core.g_rx_fsiz=RX_FIFO_FS_SIZE; // 512
		pdev->regs->core.g_nptxfcnf=(TXH_NP_FIFO_FS_SIZE<<G_NPTX_FCNF_D_SHIFT)| // 96
				(RX_FIFO_FS_SIZE<<G_NPTX_FCNF_A_SHIFT);  // 512

		pdev->regs->core.hptx_fcnf=(TXH_P_FIFO_FS_SIZE<<PTX_FCNF_D_SHIFT) |
			((RX_FIFO_FS_SIZE+TXH_NP_FIFO_FS_SIZE)<<PTX_FCNF_A_SHIFT);
	}

	pdev->regs->core.g_otg_ctl&=~G_OTG_CTL_HSHNPEN;

	usb_core_flush_tx_fifo(pdev->regs,0x10);
	usb_core_flush_rx_fifo(pdev->regs);

	for(i=0;i<pdev->cfg.host_channels;i++) {
		pdev->regs->hc[i].hc_int=0xffffffff;
		pdev->regs->hc[i].hc_intmsk=0;
	}
	
	vbus_drive(pdev->regs,1);

	host_enable_int(pdev);

	return 0;	
}

static int isEvenFrame(struct usb_otg_regs *regs) {
	return !(regs->host.h_fnum&1);
}

static void vbus_drive(struct usb_otg_regs *regs, unsigned int state) {
	int prtpwr;

	drive_vbus(state);
	
	prtpwr=read_hprt0(regs)&H_PRT_PPWR;
	if (state && !prtpwr) {
		regs->host.h_prt|=H_PRT_PPWR;
	} else {
		regs->host.h_prt&=~H_PRT_PPWR;
	}
	
	sys_mdelay(200);
}

static int host_enable_int(struct usb_dev_handle *pdev) {

	pdev->regs->core.g_int_msk=0;
	pdev->regs->core.g_int_sts= 0xffffffff;

	common_irq_enable(pdev->regs);

	if (!pdev->cfg.dma_enable) {
		pdev->regs->core.g_int_msk|= (G_INT_STS_RXFLVL|
						G_INT_STS_HPRTINT|
						G_INT_STS_HCINT|
						G_INT_STS_DISCINT|
						G_INT_STS_SOF|
						G_INT_STS_INCOMPISOOUT);
	} else {
		pdev->regs->core.g_int_msk|= (G_INT_STS_HPRTINT|
						G_INT_STS_HCINT|
						G_INT_STS_DISCINT|
						G_INT_STS_SOF|
						G_INT_STS_INCOMPISOOUT);
	}
	return 0;
}


static void init_fs_ls_p_clksel(struct usb_otg_regs *regs, unsigned int freq) {
	regs->host.h_cfg|=freq;
}

static unsigned int read_hprt0(struct usb_otg_regs *regs) {
	unsigned int hprt0=regs->host.h_prt;
	hprt0&=~(H_PRT_PENA|
		H_PRT_PCDET|
		H_PRT_PENCHNG|
		H_PRT_POCCHNG);
	return hprt0;
}

static unsigned int get_host_all_channel_irq(struct usb_otg_regs *regs) {
	return regs->host.h_aint;
}

static int reset_port(struct usb_otg_regs *regs) {
	unsigned int hprt0=read_hprt0(regs);

	regs->host.h_prt=hprt0|H_PRT_PRST;
	sys_mdelay(10);
	regs->host.h_prt=hprt0;
	sys_mdelay(29);
	return 1;
}

static int host_channel_init(struct usb_dev_handle *pdev, 
				unsigned int channel) {
	unsigned int intmask=0;
	unsigned int hcchar;

	pdev->regs->hc[channel].hc_int=0xffffffff;
	if (pdev->cfg.dma_enable) {
		intmask=HC_INT_AHBERR;
	}
	switch(pdev->host.fd[channel].hc.ep_type) {
		case EP_TYPE_CTRL:
		case EP_TYPE_BULK:
			intmask|=(HC_INT_XFERC|HC_INT_STALL|
				HC_INT_TXERR|HC_INT_DTERR|
				HC_INT_NAK);
			if (pdev->host.fd[channel].hc.ep_is_in) {
				intmask|=HC_INT_BBLERR;
			} else {
				intmask|=HC_INT_NYET;
				if (pdev->host.fd[channel].hc.do_ping) {
					intmask|=HC_INT_ACK;
				}
			}
			break;
		case EP_TYPE_IRQ:
			intmask|=(HC_INT_XFERC|HC_INT_NAK|
				HC_INT_STALL|HC_INT_TXERR|
				HC_INT_DTERR|HC_INT_FROVR);
			if (pdev->host.fd[channel].hc.ep_is_in) {
				intmask|=HC_INT_BBLERR;
			}
			break;
		case EP_TYPE_ISO:
			intmask|=(HC_INT_XFERC|HC_INT_FROVR|
				HC_INT_ACK);
			if(pdev->host.fd[channel].hc.ep_is_in) {
				intmask|=(HC_INT_TXERR|HC_INT_BBLERR);
			}
			break;
	}
	pdev->regs->hc[channel].hc_intmsk=intmask;
	pdev->regs->host.h_aint_msk|=(1<<channel);
	pdev->regs->core.g_int_msk|=G_INT_STS_HCINT;

	hcchar = (pdev->host.fd[channel].hc.dev_addr<<HC_CHAR_DEVADDR_SHIFT)|
		(pdev->host.fd[channel].hc.ep_num<<HC_CHAR_EPNUM_SHIFT)|
		(pdev->host.fd[channel].hc.ep_is_in?HC_CHAR_EPDIR_IN:0)|
		(pdev->host.fd[channel].hc.speed==HPRT_SPEED_LOW?HC_CHAR_LSDEV:0)|
		(pdev->host.fd[channel].hc.ep_type<<HC_CHAR_ETYPE_SHIFT)|
		(pdev->host.fd[channel].hc.max_pkt_size<<HC_CHAR_MPSIZ_SHIFT);

	if (pdev->host.fd[channel].hc.ep_type==EP_TYPE_IRQ) {
		hcchar|=HC_CHAR_ODDFRM;
	}
	pdev->regs->hc[channel].hc_char=hcchar;
	return 0;
}


static int host_channel_start_tx(struct usb_dev_handle *pdev,
				unsigned int channel) {
	unsigned int len_w=0;
	unsigned int num_packets;
	unsigned int max_pkt_count=256;
	unsigned long int hcchar;

	if (pdev->host.fd[channel].hc.xfer_len>0) {
		num_packets=(pdev->host.fd[channel].hc.xfer_len /
			pdev->host.fd[channel].hc.max_pkt_size)+1; 

		if (num_packets > max_pkt_count) {
			num_packets=max_pkt_count;
			pdev->host.fd[channel].hc.xfer_len = num_packets *
				pdev->host.fd[channel].hc.max_pkt_size;
		}
	} else {
		num_packets = 1;
	}

	pdev->regs->hc[channel].hc_tsiz=
		(pdev->host.fd[channel].hc.xfer_len<<HC_TSIZ_XFRSIZ_SHIFT)|
		(num_packets<<HC_TSIZ_PKTCNT_SHIFT)|
		(pdev->host.fd[channel].hc.data_pid<<HC_TSIZ_DPID_SHIFT);

	if (pdev->cfg.dma_enable) {
		pdev->regs->hc[channel].hc_dma=
		(unsigned long int)pdev->host.fd[channel].hc.xfer_buf;
	}

	hcchar=pdev->regs->hc[channel].hc_char;
	
	if (isEvenFrame(pdev->regs)) {
		hcchar|=HC_CHAR_ODDFRM;
	} else {
		hcchar&=~HC_CHAR_ODDFRM;
	}
	hcchar&=~HC_CHAR_CHDIS;
	hcchar|=HC_CHAR_CHENA;
	pdev->regs->hc[channel].hc_char=hcchar;

	if (!pdev->cfg.dma_enable) {
		if ((!pdev->host.fd[channel].hc.ep_is_in) &&
			(pdev->host.fd[channel].hc.xfer_len>0)) {
			switch(pdev->host.fd[channel].hc.ep_type) {
				case EP_TYPE_CTRL:
				case EP_TYPE_BULK: {
					unsigned int hnptx_stat=pdev->regs->core.g_nptxsts;
					len_w=(pdev->host.fd[channel].hc.xfer_len+3)/4;

					if (len_w>(hnptx_stat&G_NPTXSTAT_FSAV_MSK)) {
						pdev->regs->core.g_int_msk|=G_INT_STS_NPTXFE;
					}
					break;
				}
				case EP_TYPE_IRQ:
				case EP_TYPE_ISO: {
					unsigned int hptxstat=pdev->regs->host.h_ptxsts;
					len_w=(pdev->host.fd[channel].hc.xfer_len+3)/4;
					if (len_w>(hptxstat&H_PTXSTS_FSAV_MSK)) {
						pdev->regs->core.g_int_msk|=G_INT_STS_PTXFE;
					}
					break;
				}
				default:
					break;
			}
			write_pkt(pdev,channel,pdev->host.fd[channel].hc.xfer_buf,
					pdev->host.fd[channel].hc.xfer_len);
		}
	}
	return 0;
}

static int host_channel_halt(struct usb_otg_regs *regs, unsigned int channel) {
	unsigned int hcchar;

