One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
	hcchar=regs->hc[channel].hc_char;
	if ((hcchar&HC_CHAR_ETYPE_CTRL)||
		(hcchar&HC_CHAR_ETYPE_BULK)) {
		if (!(regs->core.g_nptxsts&G_NPTXSTAT_QSAV_MSK)) {
			regs->hc[channel].hc_char&=~HC_CHAR_CHENA;
		}
	} else {
		if(!(regs->host.h_ptxsts&H_PTXSTS_QSAV_MSK)) {
			regs->hc[channel].hc_char&=~HC_CHAR_CHENA;
		}
	}
	return 0;
}

static int host_channel_do_ping(struct usb_otg_regs *regs,unsigned int channel) {
	unsigned int hcchar;

	regs->hc[channel].hc_tsiz=(HC_TSIZ_DOPING|(1<<HC_TSIZ_PKTCNT_SHIFT));
	hcchar=regs->hc[channel].hc_char;
	hcchar|=HC_CHAR_CHENA;
	hcchar&=~HC_CHAR_CHDIS;
	regs->hc[channel].hc_tsiz=hcchar;
	return 0;
}

static void host_stop(struct usb_dev_handle *pdev) {
	unsigned int i;

	pdev->regs->host.h_aint_msk=0;
	pdev->regs->host.h_aint=0xffffffff;

	for(i=0;i<pdev->cfg.host_channels;i++) {
		unsigned int hcchar;
		hcchar=pdev->regs->hc[i].hc_char;
		hcchar&=~(HC_CHAR_CHENA|HC_CHAR_EPDIR_IN);
		hcchar|=HC_CHAR_CHDIS;
		pdev->regs->hc[i].hc_char=hcchar;
	}
	usb_core_flush_rx_fifo(pdev->regs);
	usb_core_flush_tx_fifo(pdev->regs, 0x10);
}


/*************** as Device  ***********************/


static void dev_speed_init(struct usb_otg_regs *regs, unsigned int speed) {
	unsigned int dcfg;

	dcfg=regs->dev.d_cfg&~DCFG_DEV_SPEED_MSK;
	regs->dev.d_cfg=dcfg|speed;
}

int usb_core_dev_core_init(struct usb_dev_handle *pdev) {
	struct usb_otg_regs *regs=pdev->regs;
	struct usb_cfg	*cfg=&pdev->cfg;
	unsigned int i;
	unsigned int dcfg;
	unsigned int tx_fifo_addr;
	
	regs->pwrclk=0;
	dcfg=regs->dev.d_cfg&~DCFG_FINTRVL_MSK;
	regs->dev.d_cfg=dcfg|DCFG_FINTRVL_80;

	if (regs==USB_OTG_FS_ADDR) {
		unsigned int tx_fifo_size[] = {TX1_FIFO_FS_SIZE,
					TX2_FIFO_FS_SIZE,
					TX3_FIFO_FS_SIZE};

		dev_speed_init(regs, DCFG_DEV_SPEED_FS_FULL);
		regs->core.g_rx_fsiz=RX_FIFO_FS_SIZE;

		regs->core.g_nptxfcnf=
			(TX0_FIFO_FS_SIZE<<G_NPTX_FCNF_D_SHIFT)|
			(RX_FIFO_FS_SIZE<<G_NPTX_FCNF_A_SHIFT);

			tx_fifo_addr=RX_FIFO_FS_SIZE+TX0_FIFO_FS_SIZE;
	
		for(i=0;i<3;i++) {
			unsigned int txfifo_data=
				(tx_fifo_size[i]<<PTX_FCNF_D_SHIFT)|
				   	tx_fifo_addr;
			tx_fifo_addr+=tx_fifo_size[i];
			regs->core.dieptxf[i]=txfifo_data;
		}

	} else if (regs==USB_OTG_HS_ADDR) {
		unsigned int tx_fifo_size[] = {TX1_FIFO_HS_SIZE,
					TX2_FIFO_HS_SIZE,
					TX3_FIFO_HS_SIZE,
					TX4_FIFO_HS_SIZE,
					TX5_FIFO_HS_SIZE};
		dev_speed_init(regs, DCFG_DEV_SPEED_FULL_IPHY);
	
		regs->core.g_rx_fsiz=RX_FIFO_HS_SIZE;

		regs->core.g_nptxfcnf=
			(TX0_FIFO_HS_SIZE<<G_NPTX_FCNF_D_SHIFT)|
			(RX_FIFO_HS_SIZE<<G_NPTX_FCNF_A_SHIFT);

		tx_fifo_addr=RX_FIFO_HS_SIZE+TX0_FIFO_HS_SIZE;
	
		for(i=0;i<5;i++) {
			unsigned int txfifo_data=
				(tx_fifo_size[i]<<PTX_FCNF_D_SHIFT)|
				   	tx_fifo_addr;
			tx_fifo_addr+=tx_fifo_size[i];
			regs->core.dieptxf[i]=txfifo_data;
		}
	}

	usb_core_flush_tx_fifo(regs, 0x10);
	usb_core_flush_rx_fifo(regs);

	regs->dev.d_diep_msk=0;
	regs->dev.d_doep_msk=0;
	regs->dev.d_aint=0xffffffff;
	regs->dev.d_aintmsk=0;

	for(i=0;i<cfg->dev_endpoints;i++) {
		unsigned int depctl;
		depctl=regs->dev.d_ep_in[i].ctl;
		if (depctl&EP_CTL_ENA) {
			depctl=EP_CTL_DIS|EP_CTL_SNAK;
		} else {
			depctl=0;
		}
		regs->dev.d_ep_in[i].ctl=depctl;
		regs->dev.d_ep_in[i].tsiz=0;
		regs->dev.d_ep_in[i].ints=0xff;
	}

	for(i=0;i<cfg->dev_endpoints;i++) {
		unsigned int depctl;
		depctl=regs->dev.d_ep_out[i].ctl;
		if (depctl&EP_CTL_ENA) {
			depctl=EP_CTL_DIS|EP_CTL_SNAK;
		} else {
			depctl=0;
		}
		regs->dev.d_ep_out[i].ctl=depctl;
		regs->dev.d_ep_out[i].tsiz=0;
		regs->dev.d_ep_out[i].ints=0xff;
	}

	regs->dev.d_diep_msk|=DDIEPMSK_TXFUR;

	if (cfg->dma_enable) {
		unsigned int dthrctl=
			(DTHRCTL_NONISOTHREN|
			DTHRCTL_ISOTHREN|
			(64<<DTHRCTL_TXTHRLEN_SHIFT)|
			DTHRCTL_RXTHREN|
			(64<<DTHRCTL_RXTHRLEN_SHIFT));
		regs->dev.d_dthr_ctl=dthrctl;
	}
	dev_enable_int(pdev);
	return 0;
}

static int dev_enable_int(struct usb_dev_handle *pdev) {
	struct usb_otg_regs *regs=pdev->regs;
	struct usb_cfg	*cfg=&pdev->cfg;	
	unsigned int intmsk=0;

	regs->core.g_int_msk=0;
	regs->core.g_int_sts=0xbfffffff;

	common_irq_enable(regs);

	if (!cfg->dma_enable) {
		intmsk=G_INT_STS_RXFLVL;
	}

	intmsk|=(G_INT_STS_USBSUSP|G_INT_STS_USBRST|
		G_INT_STS_ENUMDNE|G_INT_STS_IEPINT|
		G_INT_STS_OEPINT|G_INT_STS_SOF|
		G_INT_STS_IISOIXFR|G_INT_STS_INCOMPISOOUT|
		G_INT_STS_SRQINT|G_INT_STS_OTGINT);

	regs->core.g_int_msk|=intmsk;
	return 0;
}

static unsigned int dev_get_speed(struct usb_otg_regs *regs) {
	unsigned int enumspd;
	unsigned int speed=USB_SPEED_UNKNOWN;

	enumspd=(regs->dev.d_sts&DSTS_ENUMSPD_MSK)>>DSTS_ENUMSPD_SHIFT;
	
	switch(enumspd) {
		case DSTS_ENUMSPD_HI:
			speed=USB_SPEED_HIGH;
			break;
		case DSTS_ENUMSPD_FULL:
			speed=USB_SPEED_FULL;
			break;
	}
	return speed;
}

static int dev_EP0_activate(struct usb_otg_regs *regs) {
//	unsigned int enumspd;
	unsigned int diepctl;

#if 0
	enumspd=(usb_regs->dev.d_sts&DSTS_ENUMSPD_MSK)>>DSTS_ENUMSPD_SHIFT;
	
	switch(enumspd) {
		case DSTS_ENUMSPD_HI:
	
#endif

	diepctl=regs->dev.d_ep_in[0].ctl;
	diepctl&=~EP_CTL_MPSIZ_MSK;
	/* Set Max packet size to 0 ?? */
	regs->dev.d_ep_in[0].ctl=diepctl;

	regs->dev.d_ctl|=DCTL_CGINAK;
	return 0;
}

int usb_core_dev_EP_activate(struct usb_otg_regs *regs, struct usb_dev_ep *ep) {
	volatile unsigned int *addr;
	unsigned int daintmsk=0;
	unsigned int depctl;

	if (ep->is_in) {
		addr=&regs->dev.d_ep_in[ep->num].ctl;
		daintmsk=1<<ep->num;
	} else {
		addr=&regs->dev.d_ep_out[ep->num].ctl;
		daintmsk=0x10000<<ep->num;
	}

	depctl=*addr;
	if (!(depctl&EP_CTL_USBAEP)) {
		depctl&=~(EP_CTL_MPSIZ_MSK|EP_CTL_EPTYPE_MSK|
			EP_CTL_TXFNUM_MSK);
		depctl|=((ep->maxpacket<<EP_CTL_MPSIZ_SHIFT)|
			(ep->type<<EP_CTL_EPTYPE_SHIFT)|
			(ep->tx_fifo_num<<EP_CTL_TXFNUM_SHIFT)|
			EP_CTL_SD0PID|
			EP_CTL_USBAEP);
		*addr=depctl;
	}

	regs->dev.d_aintmsk|=daintmsk;
	return 0;
}

int usb_core_dev_EP_deactivate(struct usb_otg_regs *regs, struct usb_dev_ep *ep) {
	volatile unsigned int *addr;
	unsigned int daintmsk=0;

	if (ep->is_in) {
		addr=&regs->dev.d_ep_in[ep->num].ctl;
		daintmsk=1<<ep->num;
	} else {
		addr=&regs->dev.d_ep_out[ep->num].ctl;
		daintmsk=0x10000<<ep->num;
	}

