One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
	(*addr)&=~EP_CTL_USBAEP;

	regs->dev.d_aintmsk&=~daintmsk;
	return 0;
}

int usb_core_dev_EP_start_xfer(struct usb_dev_handle *pdev, struct usb_dev_ep *ep) {
	unsigned int depctl;
	unsigned int deptsiz;
	unsigned int dsts;

	if (ep->is_in) {
		depctl=pdev->regs->dev.d_ep_in[ep->num].ctl;
		deptsiz=pdev->regs->dev.d_ep_in[ep->num].tsiz;
		
		deptsiz&=~(EP_TSIZ_PKTCNT_MSK|EP_TSIZ_XFRSIZ_MSK);
		if (!ep->xfer_len) {
			deptsiz|=(1<<EP_TSIZ_PKTCNT_SHIFT);
		} else {
			deptsiz|=((ep->xfer_len<<EP_TSIZ_XFRSIZ_SHIFT)|
			(((ep->xfer_len-1+ep->maxpacket)/ep->maxpacket)<<EP_TSIZ_PKTCNT_SHIFT));

			if (ep->type==EP_TYPE_ISO) {
				deptsiz&=~EP_TSIZ_MCNT_MSK;
				deptsiz|=(1<<EP_TSIZ_MCNT_SHIFT);
			}
		}
		pdev->regs->dev.d_ep_in[ep->num].tsiz=deptsiz;

		if (pdev->cfg.dma_enable) {
			pdev->regs->dev.d_ep_in[ep->num].dma=ep->dma_addr;
		} else {
			if (ep->type!=EP_TYPE_ISO) {
				if (ep->xfer_len>0) {
					pdev->regs->dev.d_iep_empty_msk|=(1<<ep->num);
				}
			}
		}

		if (ep->type==EP_TYPE_ISO) {
			dsts=pdev->regs->dev.d_sts;
			if ((dsts>>DSTS_FNSOF_SHIFT)&1) {
				depctl|=EP_CTL_SD0PID;
			} else {
				depctl|=EP_CTL_SD1PID;
			}
		}

		depctl|=(EP_CTL_CNAK|EP_CTL_ENA);
		
		pdev->regs->dev.d_ep_in[ep->num].ctl=depctl;

		if (ep->type==EP_TYPE_ISO) {
			write_pkt(pdev, ep->num, ep->xfer_buf, ep->xfer_len);
		}
	} else {  /* out end point */
		depctl=pdev->regs->dev.d_ep_out[ep->num].ctl;
		deptsiz=pdev->regs->dev.d_ep_out[ep->num].tsiz;
		
		deptsiz&=~(EP_TSIZ_PKTCNT_MSK|EP_TSIZ_XFRSIZ_MSK);
		if (!ep->xfer_len) {
			deptsiz|=((ep->maxpacket<<EP_TSIZ_XFRSIZ_SHIFT)|
				(1<<EP_TSIZ_PKTCNT_SHIFT));
		} else {
			unsigned int pcnt=(ep->xfer_len+(ep->maxpacket-1))/
					ep->maxpacket;
			deptsiz|=(((pcnt*ep->maxpacket)<<EP_TSIZ_XFRSIZ_SHIFT)|
					(pcnt<<EP_TSIZ_PKTCNT_SHIFT));
		}
		pdev->regs->dev.d_ep_out[ep->num].tsiz=deptsiz;

		if (pdev->cfg.dma_enable) {
			pdev->regs->dev.d_ep_out[ep->num].dma=ep->dma_addr;
		}

		if (ep->type==EP_TYPE_ISO) {
			if (ep->even_odd_frame) {
				depctl|=EP_CTL_SD1PID;
			} else {
				depctl|=EP_CTL_SD0PID;
			}
		}

		depctl|=(EP_CTL_CNAK|EP_CTL_ENA);
		pdev->regs->dev.d_ep_out[ep->num].ctl=depctl;
	}
	return 0;
}

int usb_core_dev_EP0_start_xfer(struct usb_dev_handle *pdev, struct usb_dev_ep *ep) {
	unsigned int depctl;
	unsigned int deptsiz;

	if (ep->is_in) {
		struct d_ep_in *in_ep_regs=&pdev->regs->dev.d_ep_in[0];
		depctl=in_ep_regs->ctl;
		deptsiz=in_ep_regs->tsiz;
		
		deptsiz&=~(EP_TSIZ_PKTCNT_MSK|EP_TSIZ_XFRSIZ_MSK);
		if (!ep->xfer_len) {
			deptsiz|=(1<<EP_TSIZ_PKTCNT_SHIFT);
		} else {
			if (ep->xfer_len>ep->maxpacket) {
				ep->xfer_len=ep->maxpacket;
			}
			deptsiz|=((ep->xfer_len<<EP_TSIZ_XFRSIZ_SHIFT)|
				(1<<EP_TSIZ_PKTCNT_SHIFT));
		}
		in_ep_regs->tsiz=deptsiz;
		
		if (pdev->cfg.dma_enable) {
			pdev->regs->dev.d_ep_in[ep->num].dma=ep->dma_addr;
//			in_ep_regs->dma=ep->dma_addr;
		}

		depctl|=(EP_CTL_CNAK|EP_CTL_ENA);
		
		in_ep_regs->ctl=depctl;

		if (!pdev->cfg.dma_enable) {
			if (ep->xfer_len>0) {
				pdev->regs->dev.d_iep_empty_msk|=(1<<ep->num);
			}
		}
	} else {  /* out end point */
		struct d_ep_out *ep_out_regs=&pdev->regs->dev.d_ep_out[ep->num];
		depctl=ep_out_regs->ctl;
		deptsiz=ep_out_regs->tsiz;
		
		deptsiz&=~(EP_TSIZ_PKTCNT_MSK|EP_TSIZ_XFRSIZ_MSK);
		if (ep->xfer_len) {
			ep->xfer_len=ep->maxpacket;
		}
		deptsiz|=((ep->maxpacket<<EP_TSIZ_XFRSIZ_SHIFT)|
					(1<<EP_TSIZ_PKTCNT_SHIFT));

		ep_out_regs->tsiz=deptsiz;

		if (pdev->cfg.dma_enable) {
			ep_out_regs->dma=ep->dma_addr;
		}

		depctl|=(EP_CTL_CNAK|EP_CTL_ENA);
		ep_out_regs->ctl=depctl;
	}
	return 0;
}

int usb_core_dev_EP_set_stall(struct usb_otg_regs *regs,struct usb_dev_ep *ep) {
	
	if (ep->is_in) {
		struct d_ep_in *ep_in_regs=&regs->dev.d_ep_in[ep->num];
		unsigned int depctl=ep_in_regs->ctl;
	
		if (depctl&EP_CTL_ENA) {
			depctl|=EP_CTL_DIS;
		}
		depctl|=EP_CTL_STALL;
		ep_in_regs->ctl=depctl;
	} else {
		struct d_ep_out *ep_out_regs=&regs->dev.d_ep_out[ep->num];
		unsigned int depctl=ep_out_regs->ctl;
		depctl|=EP_CTL_STALL;
		ep_out_regs->ctl=depctl;
	}
	return 0;
}

int usb_core_dev_EP_clr_stall(struct usb_otg_regs *regs,struct usb_dev_ep *ep) {
	volatile unsigned int *ctl;
	unsigned int depctl;

	if (ep->is_in) {
		struct d_ep_in *ep_in_regs=&regs->dev.d_ep_in[ep->num];
		ctl=&ep_in_regs->ctl;
	} else {
		struct d_ep_out *ep_out_regs=&regs->dev.d_ep_out[ep->num];
		ctl=&ep_out_regs->ctl;
	}
	depctl=*ctl;

	depctl&=~EP_CTL_STALL;

	if (ep->type==EP_TYPE_IRQ||ep->type==EP_TYPE_BULK) {
		depctl|=EP_CTL_SD0PID;
	}

	*ctl=depctl;

	return 0;
}

static unsigned int dev_read_all_out_ep_irq(struct usb_otg_regs *regs) {
	unsigned int irqs;
	irqs=regs->dev.d_aint;
	irqs&=regs->dev.d_aintmsk;
	return (irqs>>16);
}

static unsigned int dev_read_out_ep_irq(struct usb_otg_regs *regs, unsigned int channel) {
	unsigned int irqs;
	irqs=regs->dev.d_ep_out[channel].ints;
	irqs&=regs->dev.d_doep_msk;
	return irqs;
}	

static unsigned int dev_read_all_in_ep_irq(struct usb_otg_regs *regs) {
	unsigned int irqs;
	irqs=regs->dev.d_aint;
	irqs&=regs->dev.d_aintmsk;
	return (irqs&0xffff);
}

static unsigned int dev_read_in_ep_irq(struct usb_otg_regs *regs,unsigned int channel) {
	unsigned int mask=regs->dev.d_diep_msk;
	unsigned int emptymask=regs->dev.d_iep_empty_msk;
	mask|= ((emptymask>>channel)&1)<<7;
	return regs->dev.d_ep_in[channel].ints&mask;
}

void dev_EP0_out_start(struct usb_dev_handle *pdev) {
	unsigned int doeptsiz= (3<<EP_TSIZ_SUPCNT_SHIFT)|
				(1<<EP_TSIZ_PKTCNT_SHIFT)|
				((8*3)<<EP_TSIZ_XFRSIZ_SHIFT);
	pdev->regs->dev.d_ep_out[0].tsiz=doeptsiz;
	
	if (pdev->cfg.dma_enable) {
		unsigned int doepctl;
		pdev->regs->dev.d_ep_out[0].dma=(unsigned int)
						pdev->dev.setup_packet;

		doepctl=EP_CTL_ENA|EP_CTL_USBAEP;
//		pdev->regs->dev.d_ep_out[0].ctl|=doepctl;
		pdev->regs->dev.d_ep_out[0].ctl=doepctl;
	}
}

void dev_remote_wakeup(struct usb_dev_handle *pdev) {
	if (pdev->dev.remote_wakeup) {
		unsigned int dsts = pdev->regs->dev.d_sts;
		if (dsts&DSTS_SUSP) {
			if (pdev->cfg.low_power) {
				unsigned int pwrclk=pdev->regs->pwrclk;
				pwrclk=~(PWRCLK_GATECLK|PWRCLK_STOPPCLK);
				pdev->regs->pwrclk=pwrclk;
			}
			pdev->regs->dev.d_ctl|=DCTL_RWUSIG;
			sys_mdelay(2);
			pdev->regs->dev.d_ctl&=~DCTL_RWUSIG;
		}
	}
}

static void dev_ungate_clock(struct usb_dev_handle *pdev) {
	if (pdev->cfg.low_power) {
		if (pdev->regs->dev.d_sts&DSTS_SUSP) {
			unsigned int pwrclk=pdev->regs->pwrclk;
			pwrclk=~(PWRCLK_GATECLK|PWRCLK_STOPPCLK);
			pdev->regs->pwrclk=pwrclk;
		}
	}
}

static void dev_stop(struct usb_dev_handle *pdev) {
	unsigned int i;
	pdev->dev.dev_status=1;	

