One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
	for(i=0;i<pdev->cfg.dev_endpoints;i++) {
		pdev->regs->dev.d_ep_in[i].ints=0xff;
		pdev->regs->dev.d_ep_out[i].ints=0xff;
	}

	pdev->regs->dev.d_diep_msk=0;
	pdev->regs->dev.d_doep_msk=0;
	pdev->regs->dev.d_aintmsk=0;
	pdev->regs->dev.d_aint=0xffffffff;

	usb_core_flush_rx_fifo(pdev->regs);
	usb_core_flush_tx_fifo(pdev->regs,0x10);
}

unsigned int usb_core_dev_get_ep_status(struct usb_otg_regs *regs, struct usb_dev_ep *ep) {
	unsigned int status=0;
	
	if (ep->is_in) {
		unsigned int depctl=regs->dev.d_ep_in[ep->num].ctl;
		if (depctl&EP_CTL_STALL) {
			status=EP_TX_STALL;
		} else if (depctl&EP_CTL_NAKSTS) {
			status=EP_TX_NAK;
		} else {
			status=EP_TX_VALID;
		}
	} else {
		unsigned int depctl=regs->dev.d_ep_out[ep->num].ctl;
		if (depctl&EP_CTL_STALL) {
			status=EP_RX_STALL;
		} else  if (depctl&EP_CTL_NAKSTS) {
			status=EP_RX_NAK;
		} else {
			status=EP_RX_VALID;
		}
	}
	return status;
}

void usb_core_dev_set_ep_status(struct usb_otg_regs *regs,
			struct usb_dev_ep *ep, unsigned int status) {
	volatile unsigned int *depctl_ptr=0;
	unsigned int depctl;

	if (ep->is_in) {
		depctl_ptr=&regs->dev.d_ep_in[ep->num].ctl;
		depctl=*depctl_ptr;
		if (status==EP_TX_STALL) {
			usb_core_dev_EP_set_stall(regs,ep);
			return;
		} else if (status==EP_TX_NAK) {
			regs->dev.d_ep_in[ep->num].ctl|=EP_CTL_SNAK;
		} else if (status==EP_TX_VALID) {
			if (depctl&EP_CTL_STALL) {
				ep->even_odd_frame=0;
				usb_core_dev_EP_clr_stall(regs,ep);
				return;
			}
			depctl|=(EP_CTL_CNAK|EP_CTL_USBAEP|EP_CTL_ENA);
		} else if (status==EP_TX_DIS) {
			depctl&=~EP_CTL_USBAEP;
		}
	} else {
		depctl_ptr=&regs->dev.d_ep_out[ep->num].ctl;
		depctl=*depctl_ptr;

		if (status==EP_RX_STALL) {
			depctl|=EP_CTL_STALL;
		} else if (status==EP_RX_NAK) {
			depctl|=EP_CTL_SNAK;
		} else if (status==EP_RX_VALID) {
			if (depctl&EP_CTL_STALL) {
				ep->even_odd_frame=0;
				usb_core_dev_EP_clr_stall(regs,ep);
				return;
			}
			depctl|=(EP_CTL_CNAK|EP_CTL_USBAEP|EP_CTL_ENA);
		} else if (status==EP_RX_DIS) {
			depctl&=~EP_CTL_USBAEP;
		}
	}
	(*depctl_ptr)=depctl;
}

void usb_core_dev_set_address(struct usb_otg_regs *regs, unsigned char address) {
	unsigned int dcfg=regs->dev.d_cfg;
	dcfg&=~DCFG_DADDR_MSK;
	dcfg|=(address<<DCFG_DADDR_SHIFT);
	regs->dev.d_cfg=dcfg;
}

void usb_core_dev_connect(struct usb_otg_regs *regs) {
	regs->dev.d_ctl&=~DCTL_SDIS;
	sys_mdelay(2);
}

void usb_core_dev_disconnect(struct usb_otg_regs *regs) {
	regs->dev.d_ctl|=DCTL_SDIS;
	sys_mdelay(2);
}


/*********************************************************** IRQ **********************************/

static unsigned int dev_write_empty_tx_fifo(struct usb_dev_handle *pdev,
						unsigned int epnum) {
	struct usb_dev_ep *ep;
	unsigned int len,wlen;
	unsigned int space_avail;

	ep=&pdev->dev.in_ep[epnum];
	len=ep->xfer_len-ep->xfer_count;

	if (len>ep->maxpacket) {
		len=ep->maxpacket;
	}

	wlen=(len+3)/4;
	space_avail=pdev->regs->dev.d_ep_in[epnum].txf_sts&EP_IN_TXF_STS_INEPTFSAV_MSK;

	while ((space_avail>wlen) &&
		ep->xfer_count<ep->xfer_len &&
		(ep->xfer_len!=0)) {

		len=ep->xfer_len-ep->xfer_count;
		if (len>ep->maxpacket) {
			len=ep->maxpacket;
		}

		wlen=(len+3)/4;

		write_pkt(pdev, epnum,ep->xfer_buf,len);
		ep->xfer_buf+=len;
		ep->xfer_count+=len;

		if (ep->xfer_count>=ep->xfer_len) {
			/* mask out ep_empty irq, we dont need it for now*/
			pdev->regs->dev.d_iep_empty_msk&=~(1<<ep->num);
		}
		
		space_avail=pdev->regs->dev.d_ep_in[epnum].txf_sts&EP_IN_TXF_STS_INEPTFSAV_MSK;
	}
	return 1;
}

#ifdef DEDICATED_EP1

unsigned int usb_device_EP1_out_handler() {
	unsigned int d_doepint;

	d_doepint=usb_regs->dev.d_ep_out[1].ints;
	d_doepint&=usb_regs->dev.d_oep_each_msk1;

	if (d_doepint&EP_OINT_XFER_DONE) {
		usb_regs->dev.d_ep_out[1].ints=EP_OINT_XFER_DONE;
		if (usb_cfg->dma_enable) {
			unsigned int xfersize=
				usb_regs->dev.d_ep_out[1].tsiz&
					EP_TSIZ_XFRSIZ_MSK;
			usb_dev->out_ep[1].xfer_count=
				usb_dev->out_ep[1].maxpacket - xfersize;
		}
		usb_device_cb->data_out(1);
	}

	if (d_doepint&EP_OINT_DISABLED) {
		usb_regs->dev.d_ep_out[1].ints=EP_OINT_DISABLED;
	}
	return 1;
}


unsigned int usb_device_EP1_in_handler() {
	unsigned int d_diepint;
	unsigned int fifoemptymsk, msk, empty;
	
	msk=usb_regs->dev.d_iep_each_msk1;
	empty=usb_regs->dev.d_iep_empty_msk;
	msk|=(((empty>>1)&1)<<7); // use reserved bit to indicate empty 
	d_diepint=usb_regs->dev.d_ep_in[1].ints & msk;

	if (d_diepint&EP_IINT_XFER_DONE) {
		fifoemptymsk=0x1<<1;
		usb_regs->dev.d_iep_empty_msk&=~fifoemptymsk;
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_XFER_DONE;
		usb_device_cb->data_in(1);
	}

	if (d_diepint&EP_IINT_DISABLED) {
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_DISABLED;
	}

	if (d_diepint&EP_IINT_TIMEOUT) {
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_TIMEOUT;
	}

	if (d_diepint&EP_IINT_ITTXFE) {
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_ITTXFE;
	}

	if (d_diepint&EP_IINT_INEPNE) {
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_INEPNE;
	}

	if (d_diepint&EP_IINT_TXFE) {
		dev_write_empty_tx_fifo(1);
		usb_regs->dev.d_ep_in[1].ints=EP_IINT_TXFE;
	}
	return 1;
}

#endif

static unsigned int device_handle_resume_irq(struct usb_dev_handle *pdev) {

	if (pdev->cfg.low_power) {
		unsigned int pwrclk=pdev->regs->pwrclk;
		pwrclk=~(PWRCLK_GATECLK|PWRCLK_STOPPCLK);
		pdev->regs->pwrclk=pwrclk;
	}
	pdev->regs->dev.d_ctl&=~DCTL_RWUSIG;

	usbd_resume(pdev);

	pdev->regs->core.g_int_sts=G_INT_STS_WKUIN;

	return 1;
}

static unsigned int device_handle_usb_suspend_irq(struct usb_dev_handle *pdev) {
	unsigned int prev_stat;
	unsigned int dev_stat;

	prev_stat=pdev->dev.dev_status;
	usbd_suspend(pdev);

	dev_stat=pdev->regs->dev.d_sts;
	
	pdev->regs->core.g_int_sts=G_INT_STS_USBSUSP;

	if (pdev->cfg.low_power&&(dev_stat&DSTS_SUSP)&&
		(pdev->dev.conn_status==1) &&
		(prev_stat == USB_DEV_STAT_CONFIGURED)) {
		pdev->regs->pwrclk|=PWRCLK_STOPPCLK;
		pdev->regs->pwrclk|=PWRCLK_GATECLK;
		// ask OS to bring cpu to sleep
	}
	return 1;
}

static unsigned int device_handle_inep_irq(struct usb_dev_handle *pdev) {
	unsigned int ep_intr;
	unsigned int epnum=0;
	unsigned int fifoemptymsk=0;

	ep_intr=dev_read_all_in_ep_irq(pdev->regs);
	while(ep_intr) {
		if (ep_intr&0x1) {
			unsigned int diepint=dev_read_in_ep_irq(pdev->regs,epnum);
			if (diepint&EP_IINT_XFER_DONE) {
				fifoemptymsk=1<<epnum;
				pdev->regs->dev.d_iep_empty_msk&=~fifoemptymsk;
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_XFER_DONE;
				usbd_data_in(pdev,epnum);

				if (pdev->cfg.dma_enable) {
					if ((epnum==0)&&(pdev->dev.dev_state==USB_DEV_EP0_STATUS_IN)) {
						dev_EP0_out_start(pdev);
					}
				}
			}

			if (diepint&EP_IINT_TIMEOUT) {
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_TIMEOUT;
			}

