One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
			if (diepint&EP_IINT_ITTXFE) {
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_ITTXFE;
			}

			if (diepint&EP_IINT_INEPNE) {
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_INEPNE;
			}

			if (diepint&EP_IINT_DISABLED) {
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_DISABLED;
			}

			if (diepint&EP_IINT_TXFE) {
				dev_write_empty_tx_fifo(pdev, epnum);
				pdev->regs->dev.d_ep_in[epnum].ints=EP_IINT_TXFE;
			}
		}
		epnum++;
		ep_intr >>= 1;
	}
	return 1;
}

static unsigned int device_handle_outep_irq(struct usb_dev_handle *pdev) {
	unsigned int ep_intr;
	unsigned int epnum=0;

	ep_intr=dev_read_all_out_ep_irq(pdev->regs);
	
	while(ep_intr) {
		if (ep_intr&0x1) {
			unsigned int doepint=dev_read_out_ep_irq(pdev->regs,epnum);
			if (doepint&EP_OINT_XFER_DONE) {
				pdev->regs->dev.d_ep_out[epnum].ints=EP_OINT_XFER_DONE;
				if (pdev->cfg.dma_enable) {
					unsigned int deptsiz;
					deptsiz=pdev->regs->dev.d_ep_out[epnum].tsiz;
					pdev->dev.out_ep[epnum].xfer_count = 
						pdev->dev.out_ep[epnum].maxpacket -
						(deptsiz&EP_TSIZ_XFRSIZ_MSK);
				}
				usbd_data_out(pdev,epnum);
				if (pdev->cfg.dma_enable) {
					if ((epnum==0)&&(pdev->dev.dev_state==USB_DEV_EP0_STATUS_OUT)) {
						dev_EP0_out_start(pdev);
					}
				}
			}
			
			if (doepint&EP_OINT_DISABLED) {
				pdev->regs->dev.d_ep_out[epnum].ints=EP_OINT_DISABLED;
			}

			if (doepint&EP_OINT_SETUP_DONE) {
				usbd_setup(pdev);
				pdev->regs->dev.d_ep_out[epnum].ints=EP_OINT_SETUP_DONE;
			}
		}
		epnum++;
		ep_intr>>=1;
	}
	return 1;
}

static unsigned int device_handle_sof_irq(struct usb_dev_handle *pdev) {
	usbd_sof(pdev);
	pdev->regs->core.g_int_sts=G_INT_STS_SOF;
	return 1;
}

static unsigned int device_handle_rxfifo_irq(struct usb_dev_handle *pdev) {
	unsigned int status;
	struct usb_dev_ep *ep;

	pdev->regs->core.g_int_msk&=~G_INT_STS_RXFLVL;
	status=pdev->regs->core.g_rx_sts_p;

	ep=&pdev->dev.out_ep[status&G_RX_STS_EPNUM_MSK];

	switch((status&G_RX_STS_PKTSTAT_MSK)>>G_RX_STS_PKTSTAT_SHIFT) {
		case G_RX_STS_PKTSTAT_GOUT_NAK:
			break;
		case G_RX_STS_PKTSTAT_ODATA_RECEIVED: {
			unsigned int bcnt=(status&G_RX_STS_BCNT_MSK);
			if (bcnt) {
				bcnt>>=G_RX_STS_BCNT_SHIFT;
				read_pkt(pdev,ep->xfer_buf,bcnt);
				ep->xfer_buf+=bcnt;
				ep->xfer_count+=bcnt;
			}
			break;
		}
		case G_RX_STS_PKTSTAT_OXFER_DONE:
			break;
		case G_RX_STS_PKTSTAT_SXFER_DONE:
			break;
		case G_RX_STS_PKTSTAT_SDATA_RECEIVED: {
			unsigned int bcnt=(status&G_RX_STS_BCNT_MSK)>>G_RX_STS_BCNT_SHIFT;
			read_pkt(pdev,pdev->dev.setup_packet, 8);
			ep->xfer_count += bcnt;
			break;
		}
		default:
			break;
	}
	pdev->regs->core.g_int_msk|=G_INT_STS_RXFLVL;
	return 1;
}

unsigned int device_handle_usb_reset_irq(struct usb_dev_handle *pdev) {
	unsigned int i;

	pdev->regs->dev.d_ctl&=~DCTL_RWUSIG;

	usb_core_flush_tx_fifo(pdev->regs,0);

	for(i=0;i<pdev->cfg.dev_endpoints;i++) {
		pdev->regs->dev.d_ep_in[i].ints=0xff;
		pdev->regs->dev.d_ep_out[i].ints=0xff;
	}

	pdev->regs->dev.d_aint=0xffffffff;
	pdev->regs->dev.d_aintmsk=(1<<16)|(1<<0);

	pdev->regs->dev.d_doep_msk=
		DDOEPMSK_SETUP|DDOEPMSK_XFER_DONE|DDOEPMSK_EPDISABLED;
#ifdef DEDICATED_EP1
	pdev->regs->dev.d_doep_each_msk1=
		DDOEPMSK_SETUP|DDOEPMSK_XFER_DONE|DDOEPMSK_EPDISABLED;
//		DDOEPMSK_XFER_DONE|DDOEPMSK_EPDISABLED;
#endif

	pdev->regs->dev.d_diep_msk=
		DDIEPMSK_XFRC|DDIEPMSK_TO|DDIEPMSK_EPD;
#ifdef DEDICATED_EP1
	pdev->regs->dev.d_diep_each_msk1=
		DDIEPMSK_XFRC|DDIEPMSK_TO|DDIEPMSK_EPD;
#endif

	pdev->regs->dev.d_cfg&=~DCFG_DADDR_MSK;

	dev_EP0_out_start(pdev);

	pdev->regs->core.g_int_sts=G_INT_STS_USBRST;

	usbd_reset(pdev);

	return 1;
}

static unsigned int device_handle_enum_done_irq(struct usb_dev_handle *pdev) {
	unsigned int usbcfg;
	dev_EP0_activate(pdev->regs);

	usbcfg=pdev->regs->core.g_usb_cfg;

	if (dev_get_speed(pdev->regs)==USB_SPEED_HIGH) {
		pdev->cfg.speed=USB_SPEED_HIGH;
		pdev->cfg.maxpacketsize=USB_HS_MAX_PACKET_SIZE;
		usbcfg&=~G_USB_CFG_TRDT_MSK;
		usbcfg|=(9<<G_USB_CFG_TRDT_SHIFT);
	} else {
		pdev->cfg.speed=USB_SPEED_FULL;
		pdev->cfg.maxpacketsize=USB_FS_MAX_PACKET_SIZE;
		usbcfg&=~G_USB_CFG_TRDT_MSK;
		usbcfg|=(5<<G_USB_CFG_TRDT_SHIFT);
	}

	pdev->regs->core.g_usb_cfg=usbcfg;
	pdev->regs->core.g_int_sts=G_INT_STS_ENUMDNE;
	return 1;
}

static unsigned int device_handle_incomplete_iso_in_irq(struct usb_dev_handle *pdev) {

	usbd_iso_in_incomplete(pdev);
	pdev->regs->core.g_int_sts=G_INT_STS_IISOIXFR;
	return 1;
}

static unsigned int device_handle_incomplete_iso_out_irq(struct usb_dev_handle *pdev) {

	usbd_iso_out_incomplete(pdev);
	pdev->regs->core.g_int_sts=G_INT_STS_INCOMPISOOUT;
	return 1;
}

static unsigned int device_handle_session_req_irq(struct usb_dev_handle *pdev) {
//	usbd_dev_connected(pdev);
	pdev->regs->core.g_int_sts=G_INT_STS_SRQINT;
	return 1;
}

static unsigned int device_handle_otg_irq(struct usb_dev_handle *pdev) {
	unsigned int gotgint=pdev->regs->core.g_otg_gint;

	if (gotgint&G_OTG_INT_SEDET) {
//		usbd_dev_disconnected(pdev);
	}

	pdev->regs->core.g_otg_gint=gotgint;
	return 1;
}

unsigned int handle_device_irq(struct usb_dev_handle *pdev) {
	unsigned int rc=0;

	if (get_mode(pdev->regs)!=HOST_MODE) {
		unsigned int gint_status=get_core_irq_stat(pdev->regs);
		if (!gint_status) {
			sys_printf("handle_device_irq: spurious\n");
			return 0;
		}

		if (gint_status&G_INT_STS_OEPINT) {
			gint_status&=~G_INT_STS_OEPINT;
			rc|=device_handle_outep_irq(pdev);
		}

		if (gint_status&G_INT_STS_IEPINT) {
			gint_status&=~G_INT_STS_IEPINT;
			rc|=device_handle_inep_irq(pdev);
		}

		if (gint_status&G_INT_STS_MMIS) {
			gint_status&=~G_INT_STS_MMIS;
			pdev->regs->core.g_int_sts=G_INT_STS_MMIS;
		}

		if (gint_status&G_INT_STS_WKUIN) {
			gint_status&=~G_INT_STS_WKUIN;
			rc|=device_handle_resume_irq(pdev);
		}

		if (gint_status&G_INT_STS_USBSUSP) {
			gint_status&=~G_INT_STS_USBSUSP;
			rc|=device_handle_usb_suspend_irq(pdev);
		}

		if (gint_status&G_INT_STS_SOF) {
			gint_status&=~G_INT_STS_SOF;
			rc|=device_handle_sof_irq(pdev);
		}

		if (gint_status&G_INT_STS_RXFLVL) {
			gint_status&=~G_INT_STS_RXFLVL;
			rc|=device_handle_rxfifo_irq(pdev);
		}

		if (gint_status&G_INT_STS_USBRST) {
			gint_status&=~G_INT_STS_USBRST;
			rc|=device_handle_usb_reset_irq(pdev);
		}

		if (gint_status&G_INT_STS_ENUMDNE) {
			gint_status&=~G_INT_STS_ENUMDNE;
			rc|=device_handle_enum_done_irq(pdev);
		}

		if (gint_status&G_INT_STS_IISOIXFR) {
			gint_status&=~G_INT_STS_IISOIXFR;
			rc|=device_handle_incomplete_iso_in_irq(pdev);
		}

		if (gint_status&G_INT_STS_INCOMPISOOUT) {
			gint_status&=~G_INT_STS_INCOMPISOOUT;
			rc|=device_handle_incomplete_iso_out_irq(pdev);
		}

		if (gint_status&G_INT_STS_SRQINT) {
			gint_status&=~G_INT_STS_SRQINT;
			rc|=device_handle_session_req_irq(pdev);
		}

		if (gint_status&G_INT_STS_OTGINT) {
			gint_status&=~G_INT_STS_OTGINT;
			rc|=device_handle_otg_irq(pdev);
		}

		if (gint_status) {
			sys_printf("handle_device_irq: unhandled irq %x\n",
					gint_status);
		}
	}
	return rc;
}

/***************************************************************************/

