One-ders/kernel32/bl2/arch/stm32/usb/usb_core.c
#if 0
struct usb_core_fnc usb_core_fncs = {
	.reset_core=reset_core,
        .write_pkt=write_pkt,
        .read_pkt=read_pkt,
//        .init_core=init_core,
//        .enable_gint=enable_gint,
//        .disable_gint=disable_gint,
//        .flush_tx_fifo=flush_tx_fifo,
//        .flush_rx_fifo=flush_rx_fifo,
//        .set_mode=set_mode,
        .get_mode=get_mode,
        .get_core_irq_stat=get_core_irq_stat,
        .get_otg_irq_stat=get_otg_irq_stat,
        /****                                     ****/
        .host_init_core=host_init_core,
        .host_enable_int=host_enable_int,
        .host_stop=host_stop,
        .isEvenFrame=isEvenFrame,
        .drive_vbus=drive_vbus,
        .init_fs_ls_p_clksel=init_fs_ls_p_clksel,
        .read_hprt0=read_hprt0,
        .get_host_all_channel_irq=get_host_all_channel_irq,
        .reset_port=reset_port,
        /****                                     ****/
        .host_channel_init=host_channel_init,
        .host_channel_start_tx=host_channel_start_tx,
        .host_channel_halt=host_channel_halt,
        .host_channel_do_ping=host_channel_do_ping,
        /****                                    ****/
        .dev_speed_init=dev_speed_init,
//        .dev_core_init=dev_core_init,
        .dev_enable_int=dev_enable_int,
        .dev_get_speed=dev_get_speed,
        .dev_EP0_activate=dev_EP0_activate,
//        .dev_EP_activate=dev_EP_activate,
//        .dev_EP_deactivate=dev_EP_deactivate,
//        .dev_EP_start_xfer=dev_EP_start_xfer,
//        .dev_EP0_start_xfer=dev_EP0_start_xfer,
//        .dev_EP_set_stall=dev_EP_set_stall,
//        .dev_EP_clr_stall=dev_EP_clr_stall,
        .dev_read_all_out_ep_irq=dev_read_all_out_ep_irq,
        .dev_read_out_ep_irq=dev_read_out_ep_irq,
        .dev_read_all_in_ep_irq=dev_read_all_in_ep_irq,
        .dev_EP0_out_start=dev_EP0_out_start,
        .dev_remote_wakeup=dev_remote_wakeup,
        .dev_ungate_clock=dev_ungate_clock,
        .dev_stop=dev_stop,
//        .dev_get_ep_status=dev_get_ep_status,
//       .dev_set_ep_status=dev_set_ep_status
};
#endif

